# coding=utf-8
import ssl

import pyecharts.options as opts
from pyecharts.charts import Map
from pyecharts.datasets import register_url
from pyecharts.charts import Map, Timeline

ssl._create_default_https_context = ssl._create_unverified_context

WEATHER_LINK = (
    "https://weather.cma.cn/web/weather/45005.html"
)
MAP_DATA = [
    # 日期 "2023/10/16"
    [
        ["中西区", 26],
        ["湾仔", 26],
        ["东区", 26],
        ["南区", 25],
        ["油尖旺", 27],
        ["深水埗", 25],
        ["九龙城", 26],
        ["黄大仙", 27],
        ["观塘", 26],
        ["葵青", 27],
        ["荃湾", 25],
        ["屯门", 25],
        ["元朗", 26],
        ["北区", 27],
        ["大埔", 25],
        ["沙田", 26],
        ["西贡", 27],
        ["离岛", 26],
    ],
    # 日期 "2023/10/17"
    [
        ["中西区", 27],
        ["湾仔", 28],
        ["东区", 28],
        ["南区", 26],
        ["油尖旺", 25],
        ["深水埗", 27],
        ["九龙城", 25],
        ["黄大仙", 26],
        ["观塘", 24],
        ["葵青", 25],
        ["荃湾", 26],
        ["屯门", 25],
        ["元朗", 27],
        ["北区", 25],
        ["大埔", 27],
        ["沙田", 28],
        ["西贡", 26],
        ["离岛", 27],
    ],
# 日期 "2023/10/18"
    [
        ["中西区", 25],
        ["湾仔", 25],
        ["东区", 25],
        ["南区", 26],
        ["油尖旺", 26],
        ["深水埗", 26],
        ["九龙城", 25],
        ["黄大仙", 26],
        ["观塘", 25],
        ["葵青", 26],
        ["荃湾", 27],
        ["屯门", 26],
        ["元朗", 25],
        ["北区", 27],
        ["大埔", 25],
        ["沙田", 26],
        ["西贡", 26],
        ["离岛", 24],
    ],
# 日期 "2023/10/19"
    [
        ["中西区", 25],
        ["湾仔", 25],
        ["东区", 26],
        ["南区", 25],
        ["油尖旺", 27],
        ["深水埗", 25],
        ["九龙城", 26],
        ["黄大仙", 27],
        ["观塘", 26],
        ["葵青", 25],
        ["荃湾", 25],
        ["屯门", 25],
        ["元朗", 26],
        ["北区", 27],
        ["大埔", 25],
        ["沙田", 26],
        ["西贡", 25],
        ["离岛", 26],
    ],
# 日期 "2023/10/20"
    [
        ["中西区", 27],
        ["湾仔", 24],
        ["东区", 23],
        ["南区", 27],
        ["油尖旺", 25],
        ["深水埗", 26],
        ["九龙城", 26],
        ["黄大仙", 24],
        ["观塘", 25],
        ["葵青", 27],
        ["荃湾", 25],
        ["屯门", 26],
        ["元朗", 26],
        ["北区", 24],
        ["大埔", 23],
        ["沙田", 26],
        ["西贡", 25],
        ["离岛", 26],
    ],
# 日期 "2023/10/21"
    [
        ["中西区", 27],
        ["湾仔", 26],
        ["东区", 26],
        ["南区", 25],
        ["油尖旺", 27],
        ["深水埗", 25],
        ["九龙城", 26],
        ["黄大仙", 27],
        ["观塘", 26],
        ["葵青", 27],
        ["荃湾", 25],
        ["屯门", 27],
        ["元朗", 26],
        ["北区", 27],
        ["大埔", 25],
        ["沙田", 26],
        ["西贡", 27],
        ["离岛", 27],
    ],
# 日期 "2023/10/22"
    [
        ["中西区", 24],
        ["湾仔", 26],
        ["东区", 26],
        ["南区", 25],
        ["油尖旺", 24],
        ["深水埗", 25],
        ["九龙城", 26],
        ["黄大仙", 24],
        ["观塘", 26],
        ["葵青", 27],
        ["荃湾", 25],
        ["屯门", 25],
        ["元朗", 26],
        ["北区", 24],
        ["大埔", 25],
        ["沙田", 26],
        ["西贡", 24],
        ["离岛", 24],
    ],
]

NAME_MAP_DATA = {
    "中西区": "中西区",
    "东区": "东区",
    "离岛区": "离岛",
    "九龙城区": "九龙城",
    "葵青区": "葵青",
    "观塘区": "观塘",
    "北区": "北区",
    "西贡区": "西贡",
    "沙田区": "沙田",
    "深水埗区": "深水埗",
    "南区": "南区",
    "大埔区": "大埔",
    "荃湾区": "荃湾",
    "屯门区": "屯门",
    "湾仔区": "湾仔",
    "黄大仙区": "黄大仙",
    "油尖旺区": "油尖旺",
    "元朗区": "元朗",
}
tl = Timeline()
for i in range(7):  # 修改循环范围
    map0 = (
        Map()
            .add(
            series_name="香港18区气温",
            maptype="香港",
            data_pair=MAP_DATA[i],
            name_map=NAME_MAP_DATA,
            is_map_symbol_show=False,
        )
        .set_global_opts(
            title_opts=opts.TitleOpts(
                title="香港特别行政区气温" + "（10月{}日）".format(i + 16),  # 修改标题
                subtitle="气温数据来自中国气象局",
                subtitle_link=WEATHER_LINK,
            ),
            tooltip_opts=opts.TooltipOpts(
                trigger="item", formatter="{b}<br/>{c} (℃)"
            ),
            visualmap_opts=opts.VisualMapOpts(
                min_=0,
                max_=45,
                range_text=["最高气温", "最低气温"],
                is_calculable=True,
                range_color=["lightskyblue", "yellow", "orangered"],
            ),
        )
    )
    tl.add(map0, "10月{}日".format(i + 16))  # 修改日期
tl.render("香港七日气温地图.html")

